import Head from "next/head";
import { useCallback, useEffect, useMemo, useState } from "react";

type Data = {
  "ชื่อ - นามสกุล": string;
  ตำแหน่ง: string;
  ห้อง: string;
};
const data: Data[] = [
  {
    "ชื่อ - นามสกุล": "ด.ญ.ภวรัญชน์  กลมกล่อม",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.1/1",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.อรรจฉริยา  ตุลวรรธนะ",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.1/1",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.กวินทิพย์  ผลงาม",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.1/2",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.ภัทรวดี  เมฆเมืองทอง",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.1/2",
  },
  {
    "ชื่อ - นามสกุล": "ด.ช.วรพล  ป้องวิเชียร",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.1/3",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.กษิพัทธ์  สิงหบุตร",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.1/3",
  },
  {
    "ชื่อ - นามสกุล": "ด.ช.นัทธี  พัฒน์กุลธนัตถ์",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.1/4",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.กุลภรณ์  ศุภศิริวัฒนา",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.1/4",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.รดาณัฐ โรจนโกวิท",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.2/1",
  },
  {
    "ชื่อ - นามสกุล": "ด.ช.พุทธคุณ ขุนสิทธิ์",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.2/1",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.วรินทร พฤกษวิเศษสุข",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.2/2",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.ปุริมปรัชญ์ ปัถวี",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.2/2",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.ชญารัศน์  เจริญจินดาธรณ์",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.2/3",
  },
  {
    "ชื่อ - นามสกุล": "ด.ช.คณิศร  บุณยะโอภาส",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.2/3",
  },
  {
    "ชื่อ - นามสกุล": "ด.ช.แดนไทย ตาก้อง",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.2/4",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.ณปภัสร หมอกม่วง",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.2/4",
  },
  {
    "ชื่อ - นามสกุล": "ด.ช.ธีระเศรษฐ์  พิมลวิรัชกุล",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.3/1",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.จิราภัค  ศรีสุขเจริญ",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.3/1",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.รุ่งรวิน กมลสินธุ์",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.3/2",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.ภัควลัญชญ์  โอชารส",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.3/2",
  },
  {
    "ชื่อ - นามสกุล": "ด.ช.จัสติน ชาน อาย",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.3/3",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.พิชชาภา หงษ์เวียงจันทร์",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.3/3",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.ฌานิยา  ศรีประพาฬ",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.3/4",
  },
  {
    "ชื่อ - นามสกุล": "ด.ญ.สุวพิชญ์  อานุภาพ",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.3/4",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.วรันธร  ขวัญไสวธรรม",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.4/1",
  },
  {
    "ชื่อ - นามสกุล": "นายณัฐดนัย  เตชปัญญาวงค์",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.4/1",
  },
  {
    "ชื่อ - นามสกุล": "นายฐาปนิต  รักประสงค์",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.4/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.อชิรญา  พันธุ์ยาง",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.4/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ธัญชนก  ภัคกรณ์กุล",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.4/3",
  },
  {
    "ชื่อ - นามสกุล": "นายธนัชชัย  เวสสวัสดิ์",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.4/3",
  },
  {
    "ชื่อ - นามสกุล": "นายธนพัฒน์  ทั่งทอง",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "นายดลนภัส  พุทธพงศ์วิไล",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "นายณพวิทย์  มโนสุจริตธรรม",
    ตำแหน่ง: "หัวหน้าห้อง",
    ห้อง: "ม.6/3",
  },
  {
    "ชื่อ - นามสกุล": "นายชยิน  สาริกา",
    ตำแหน่ง: "รองหัวหน้าห้อง",
    ห้อง: "ม.6/3",
  },
  {
    "ชื่อ - นามสกุล": "นายภคภาส  อัศวศิริวิลาศ",
    ตำแหน่ง: "ประธานนักเรียน",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ชญาดา  เทพพิทักษ์",
    ตำแหน่ง: "รองประธานนักเรียนฝ่ายกิจการนักเรียน",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.บุญสิตา  ชมบุญ",
    ตำแหน่ง: "รองประธานนักเรียนฝ่ายวิชาการ",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.กิรณา  กลิ่นสาหร่าย",
    ตำแหน่ง: "รองประธานนักเรียนฝ่ายกีฬาและนัทนาการ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.เณศรา  เนื่องนาคา",
    ตำแหน่ง: "รองประธานนักเรียนฝ่ายสิ่งแวดล้อม",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "นายศักดิธัช  ธนาสดใส",
    ตำแหน่ง: "รองประธานนักเรียนฝ่ายสารสนเทศ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.เพียงขวัญ  ลีลาภิวัฒน์",
    ตำแหน่ง: "เลขานุการ",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.กนกกร  ปิยพิพัฒนมงคล",
    ตำแหน่ง: "ฝ่ายกิจการนักเรียน",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ชัญญานุช  ไทรงามสูง",
    ตำแหน่ง: "ฝ่ายกิจการนักเรียน",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.อภิษฎา  วีระประดิษฐ์",
    ตำแหน่ง: "ฝ่ายกิจการนักเรียน",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "นายคมชาญ  บุญประจักษ์",
    ตำแหน่ง: "ฝ่ายกิจการนักเรียน",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "นายพชร  โฆษิตรเนศ",
    ตำแหน่ง: "ฝ่ายกิจการนักเรียน",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "นายพิชญุตม์  สุวรรณมุณี",
    ตำแหน่ง: "ฝ่ายกิจการนักเรียน",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "นายยศภัทร  ชวลี",
    ตำแหน่ง: "ฝ่ายกิจการนักเรียน",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ณัฐชยาภรณ์  กลิ้งกลม",
    ตำแหน่ง: "ฝ่ายกิจการนักเรียน",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ณิชาภา  จินดาสงวน",
    ตำแหน่ง: "ฝ่ายกิจการนักเรียน",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.สุพิชญา  เอกอนันตไชย",
    ตำแหน่ง: "ฝ่ายกิจการนักเรียน",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "นายสกรรจ์  โลหิตโยธิน",
    ตำแหน่ง: "ฝ่ายกิจการนักเรียน",
    ห้อง: "ม.5/3",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.รัญญาภรณ์  เมืองสุวรรณ",
    ตำแหน่ง: "ฝ่ายกิจการนักเรียน",
    ห้อง: "ม.5/3",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ศิรภัสสร  เลาะเงิน",
    ตำแหน่ง: "ฝ่ายกิจการนักเรียน",
    ห้อง: "ม.5/3",
  },
  {
    "ชื่อ - นามสกุล": "นายชิษณุพงศ์  อนันต์ฤทธิ์กุล",
    ตำแหน่ง: "ฝ่ายกีฬาและนันทนาการ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "นายปัณณ์  ชุณหะสุต",
    ตำแหน่ง: "ฝ่ายกีฬาและนันทนาการ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.คัลลองบุณย์  บุญจรัส",
    ตำแหน่ง: "ฝ่ายกีฬาและนันทนาการ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ชญาณ์นันท์  วงษ์สวัสดิ์",
    ตำแหน่ง: "ฝ่ายกีฬาและนันทนาการ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.โชษิตา  ตาทิพย์",
    ตำแหน่ง: "ฝ่ายกีฬาและนันทนาการ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ธนัชชญา  ถิระปรารมณ์ ",
    ตำแหน่ง: "ฝ่ายกีฬาและนันทนาการ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ธีรกาญจน์  ผลทรัพย์",
    ตำแหน่ง: "ฝ่ายกีฬาและนันทนาการ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ปรินทร  ปรินทร",
    ตำแหน่ง: "ฝ่ายกีฬาและนันทนาการ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ปาณิศรา  นานานนท์",
    ตำแหน่ง: "ฝ่ายกีฬาและนันทนาการ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "นายภูวิศ  วาทะงาม",
    ตำแหน่ง: "ฝ่ายกีฬาและนันทนาการ",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ณัชชา  คนมาก",
    ตำแหน่ง: "ฝ่ายกีฬาและนันทนาการ",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.พรทิพ  ซุนสง่า  ",
    ตำแหน่ง: "ฝ่ายกีฬาและนันทนาการ",
    ห้อง: "ม.5/3",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ภัทรชนก  เสมแย้ม ",
    ตำแหน่ง: "ฝ่ายกีฬาและนันทนาการ",
    ห้อง: "ม.5/3",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.พิมพิชชา  กมลกลาง",
    ตำแหน่ง: "ฝ่ายวิชาการ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "นายธนัช  อนุกูล",
    ตำแหน่ง: "ฝ่ายวิชาการ",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.กฤตยา  พยัพไพร",
    ตำแหน่ง: "ฝ่ายวิชาการ",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.พิมพ์พิชชา  อ้นเพียร",
    ตำแหน่ง: "ฝ่ายวิชาการ",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.วาสิตา  ทองประมูล",
    ตำแหน่ง: "ฝ่ายวิชาการ",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "นายณภัทรพล  สำเริง",
    ตำแหน่ง: "ฝ่ายวิชาการ",
    ห้อง: "ม.5/3",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.นิศารัตน์  ก้อนทอง",
    ตำแหน่ง: "ฝ่ายวิชาการ",
    ห้อง: "ม.5/3",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.หัฐยาพร  กลำพบุตร",
    ตำแหน่ง: "ฝ่ายวิชาการ",
    ห้อง: "ม.5/3",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.อัญชนา  สอนจันทร์",
    ตำแหน่ง: "ฝ่ายวิชาการ",
    ห้อง: "ม.5/3",
  },
  {
    "ชื่อ - นามสกุล": "นายพชร  พจน์จารุกิจ",
    ตำแหน่ง: "ฝ่ายสิ่งแวดล้อม",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ญาดา  รักสุวรรณนิมิต",
    ตำแหน่ง: "ฝ่ายสิ่งแวดล้อม",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.วัชรพรรณ  โรจน์รุ่งมณี",
    ตำแหน่ง: "ฝ่ายสิ่งแวดล้อม",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.สิรามล  บุญขจร",
    ตำแหน่ง: "ฝ่ายสิ่งแวดล้อม",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "นายวชิรัชพงษ์  นาราภัทรนันท์",
    ตำแหน่ง: "ฝ่ายสิ่งแวดล้อม",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ลลภัส  สุธนาธิติกุล",
    ตำแหน่ง: "ฝ่ายสิ่งแวดล้อม",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.โชติกา  จิตประไพ  ",
    ตำแหน่ง: "ฝ่ายสิ่งแวดล้อม",
    ห้อง: "ม.5/2",
  },
  {
    "ชื่อ - นามสกุล": "นายชวิศ  มงคลสวัสดิ์",
    ตำแหน่ง: "ฝ่ายสิ่งแวดล้อม",
    ห้อง: "ม.5/3",
  },
  {
    "ชื่อ - นามสกุล": "นายกฤษกร  แจ่มอรุณ",
    ตำแหน่ง: "ฝ่ายเทคโนโลยีสารสนเทศ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "นายกสิณพจน์  ช้างปั้น",
    ตำแหน่ง: "ฝ่ายเทคโนโลยีสารสนเทศ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "นายปรานต์ณวัฒน์  แดงอินทวัฒน์",
    ตำแหน่ง: "ฝ่ายเทคโนโลยีสารสนเทศ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ปิยาภรณ์  กมลพาณิชย์",
    ตำแหน่ง: "ฝ่ายเทคโนโลยีสารสนเทศ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "นายชวิน  บริเวณไพศาล",
    ตำแหน่ง: "ฝ่ายเทคโนโลยีสารสนเทศ",
    ห้อง: "ม.5/1",
  },
  {
    "ชื่อ - นามสกุล": "นายณัฐสิทธิ์  พิพัฒนสุภรณ์",
    ตำแหน่ง: "ฝ่ายเทคโนโลยีสารสนเทศ",
    ห้อง: "ม.5/3",
  },
  {
    "ชื่อ - นามสกุล": "นายธนภัทร  แดงประไพ",
    ตำแหน่ง: "ฝ่ายเทคโนโลยีสารสนเทศ",
    ห้อง: "ม.5/3",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ชยาบุญญ์ จุลหิรัญ",
    ตำแหน่ง: "ฝ่ายเทคโนโลยีสารสนเทศ",
    ห้อง: "ม.5/3",
  },
  {
    "ชื่อ - นามสกุล": "นายปิติพงศ์  ผลแก้ว",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/2",
  },
  {
    "ชื่อ - นามสกุล": "นายกิตติพิชญ์  ปิ่นถาวรรักษ์",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ปาลิณี  ศรีสุทธางกูร",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.กัญญาภัทร  อิทธิพงศ์เมธี",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.เปรมวดี  โสมศุภผล",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ณัชชา  สงวนพงษ์",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/1",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ปราณปริยา  คนชุม",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ชนิดาภา  สารรัตน์",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.พิสชา  ปะสังคานนท์",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/2",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.นฤมล  พูลพันธ์",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/3",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.รติกานต์  เชี่ยวชาญ",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/3",
  },
  {
    "ชื่อ - นามสกุล": "น.ส.ชลณิชา  มะสันเทียะ",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/3",
  },
  {
    "ชื่อ - นามสกุล": "นางสาวธัญพิชา ชื่นสมบัติ",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/1 ",
  },
  {
    "ชื่อ - นามสกุล": "นายพีรดนย์ ธนาชัยประสิทธิ์",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/2",
  },
  {
    "ชื่อ - นามสกุล": "นางสาวสุธาสินี ศรีหงษ์",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/1 ",
  },
  {
    "ชื่อ - นามสกุล": "นางสาวณัฐวดี แก้วกำเนิด",
    ตำแหน่ง: "คณะกรรมการ ปีการศึกษา 64",
    ห้อง: "ม.6/1 ",
  },
];

function chunk<T>(arr: T[], len: number) {
  var chunks = [] as T[][],
    i = 0,
    n = arr.length;

  while (i < n) {
    chunks.push(arr.slice(i, (i += len)));
  }

  return chunks;
}

const replaces = new Map<string, string>([
  ["นายพชร  โฆษิตรเนศ", "(กิจการนักเรียน)"],
  ["นายพชร  พจน์จารุกิจ", "(สิ่งแวดล้อม)"],
  ["น.ส.ณัชชา  คนมาก", "(ม.5)"],
  ["น.ส.ณัชชา  สงวนพงษ์", "(ม.6)"],
]);

function getDesc(value: Data) {
  if (replaces.has(value["ชื่อ - นามสกุล"])) {
    return replaces.get(value["ชื่อ - นามสกุล"]);
  }
}

export default function Com() {
  const [corrections, setCorrections] = useState<URLSearchParams>();
  useEffect(() => {
    setCorrections(new URLSearchParams(window.location.search));
  }, []);

  const getName = useCallback(
    (value: Data, stableId: string) => {
      if (corrections && corrections.has(stableId))
        return corrections.get(stableId);
      return value["ชื่อ - นามสกุล"]
        .split(" ")[0]!
        .split(".")
        .pop()!
        .trim()
        .replace(/นาย|นางสาว/, "");
    },
    [corrections]
  );

  const appends = useMemo<Data[] | undefined>(
    () =>
      corrections?.getAll("append").map((v) => ({
        "ชื่อ - นามสกุล": v,
        ตำแหน่ง: "unknown",
        ห้อง: "unknown",
      })),
    [corrections]
  );

  return (
    <>
      <Head>
        <link
          href="https://fonts.googleapis.com/css2?family=Sarabun:wght@400;700&display=swap"
          rel="stylesheet"
        />
      </Head>
      {chunk([...data, ...(appends ?? [])], 8).map((data, group) => (
        <div
          key={`group_${group}`}
          className={`pagebreak grid grid-cols-2 gap-6`}
        >
          {data.map((d, i) => {
            const stableId = `item_${group * 8 + i + 1}`;
            const name = getName(d, stableId);
            const desc = getDesc(d);
            return (
              <div
                id={stableId}
                style={{ height: "220.34645669px", width: "340.53543307px" }}
                className="border gap-6 border-gray-500 sarabun-font p-6 flex flex-col items-center justify-center"
                key={i}
              >
                <b className="font-bold text-5xl">{name}</b>
                {desc && <span className="text-lg">{desc}</span>}
              </div>
            );
          })}
        </div>
      ))}
    </>
  );
}
